src/cf/Catalogs/АвтоподстановкиДляОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>АвтоподстановкиДляОбъектов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ТипыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проекты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроектныеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаименованияОписанияЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мероприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиПроцессов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДействиеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/АвтоподстановкиДляОбъектов/Forms/ФормаПроверки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		Параметры.Автоподстановка,
		"ТипОбъекта");
	
	Если ТипОбъекта = Перечисления.ТипыОбъектов.ДокументыПредприятия Тогда
		
		Элементы.ПроцессСсылка.ВыбиратьТип = Ложь;
		ДокументСсылка = Справочники.ДокументыПредприятия.ПустаяСсылка();
		
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.Мероприятия Тогда
		
		Элементы.ПроцессСсылка.ВыбиратьТип = Ложь;
		ДокументСсылка = Справочники.Мероприятия.ПустаяСсылка();
		
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.ЗадачиПроцессов Тогда
		
		Элементы.ПроцессСсылка.ВыбиратьТип = Ложь;
		ДокументСсылка = Задачи.ЗадачаИсполнителя.ПустаяСсылка();
	
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.НаименованияОписанияЗадач Тогда
		
		Элементы.ПроцессСсылка.ВыбиратьТип = Истина;
		ВключаяСтроки = Истина;
			
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.Задача Тогда
		
		Элементы.ПроцессСсылка.ВыбиратьТип = Ложь;
		ДокументСсылка = Документы.Задача.ПустаяСсылка();
		ВключаяСтроки = Истина;
		
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.ПустаяСсылка() Тогда
		
		Элементы.ПроцессСсылка.ВыбиратьТип = Истина;
		
	Иначе
		
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный тип объекта %1.'"), ТипОбъекта);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Проверить(Команда)
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Сообщить(НСтр("ru = 'Не заполнен документ'"));
		Возврат;
	КонецЕсли;
	
	ПроверитьНаСервере();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультатТаблица

&НаКлиенте
Процедура РезультатТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьНаСервере()
	
	РезультатТаблица.Очистить();
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	РезультатВыполнения = ШаблоныДокументов.ПолучитьЗначениеАвтоподстановки(
		Параметры.Автоподстановка, ДокументОбъект,, ВключаяСтроки);
	
	Если ТипЗнч(РезультатВыполнения) = Тип("ФорматированныйДокумент") Тогда
		ФорматированныйДокумент = РезультатВыполнения; // ФорматированныйДокумент
		РезультатВыполнения = ФорматированныйДокумент.ПолучитьТекст();
	КонецЕсли;
	
	РезультатВМассиве = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РезультатВыполнения);
	Если ТипЗнч(РезультатВыполнения) = Тип("Массив") И РезультатВыполнения.Количество() > 0 Тогда
		РезультатВМассиве = РезультатВыполнения;
	КонецЕсли;
	
	Для Каждого Эл Из РезультатВМассиве Цикл
		Стр = РезультатТаблица.Добавить();
		Стр.Элемент = Эл;
		Стр.ТипЭлемента = ТипЗнч(Эл);
		Если Стр.ТипЭлемента = Тип("Массив") И Эл.Количество() = 0 Тогда
			Стр.Элемент = НСтр("ru = '<Пустой массив>'");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
